[
    {
      "image": "banner_bloom.png",
      "title": "title_bloom.png",
      "description": "\"<strong>Bloom</strong>\" is an <strong>edutainment mobile application</strong> developed as part of a university project for the CM50109 Software Engineering module by Team Plum. It focuses on teaching users about indoor plant care through an <strong>engaging blend of education and entertainment</strong>. The app allows users to learn about different indoor plants, manage their care, and earn rewards through <strong>interactive gameplay</strong>.",
      "codeLink": "https://github.com/dfoshidero/Bloom",
      "language": ["JavaScript", "React Native","CSS"],
      "features": ["Sun Oracle", "Educational Quizzes",
      "Plant Maintenance",
      "Interactive Hub Interface",
      "Difficulty Levels",
      "Real-time Management",
      "Rewards and Achievements"],
      "system": "Bloom uses JavaScript (ES6+) as its primary programming language, along with the React and React-Native frameworks, and the Expo development platform. Additionally, the team relies on Node.js for server-side functionality and Git for version control and collaboration.",
      "system-link": {"React-Native":"https://reactnative.dev/"},
      "video": "v2pALOEpWOQ"
    },
    {
      "image": "banner_meteror.png",
      "title": "title_meteror.png",
      "description": "\"Meteor Rain\" is an immersive interactive visual novel with original characters and sprites. The captivating narrative follows a branching storyline, where the outcome is shaped by the decisions made throughout the game. Emphasizing the impact of player choices, \"Meteor Rain\" offers a compelling interactive experience that encourages multiple playthroughs.",
      "codeLink": "https://github.com/shu0202/Meteror-rain",
      "language": ["Ren'py", "Python", "ATL"],
      "features":["Original sprites","Original scenerios","Settings page","Save & load","Visual effets"],
      "system": "\"Meteor Rain\" uses Ren'py which is a visual novel engine. Ren'py is a renouned engine that is used by thousands of creators around the world. The tool helps creators to create their interactive stories that could run on computers and mobile devices using words and images. The easy to learn language allows writing large visual novels efficiently, while the Python extended scripting supports the complex animations and back-end logics.",
      "system-link": {"Ren'py":"https://www.renpy.org/"},
      "video": "9WKQRLkpwcg"
    },
    {
      "image": "banner_epiphany.png",
      "title": "title_epiphany.png",
      "description": "This game is a single player role-playing game that pays homage to the 2015 game \"<strong>Undertale</strong>\". The game sets out at a mysterious forest where the protagonist found himself waking up in. At first glance, Epiphany may appear to be the same as any other ordinary rpg games. <strong>Ultimately</strong>, based on the player's actions they will face their final judgement. The game aims at using this judgement system to educate the player about the <strong>consequences</strong> of their actions, no matter they are <strong>in a game or in real life.</strong>",
      "codeLink": "https://github.com/shu0202/Epiphany",
      "language": ["C++", "MakeFile","ncurses","Shell/Bash Scripting"],
      "features":["MakeFile auto install","ncurses keypad interaction","Main menu", "Altenatve endings","Save & load", "Unique Monsters"],
      "system": "",
      "system-link": "",
      "video": ""
    },
    {
      "image": "banner_pool.png",
      "title": "title_pool.png",
      "description": "\"<strong>Pool</strong>\" is a money pooling app that aims to provide a new way of financing among family and friends. It is developed as the product of the <strong>hackathon - Hack South West</strong> and has successfully attained the <strong>1st runner up</strong> for the best product developed. It utilises the principle of money pooling whcih allow users to invest in \"pools\" and attain interest based on the performance of the particular pool. It also allows users to put their money in friendly pool to share money within family and friends.",
      "codeLink": "https://github.com/shu0202/Pool",
      "language": ["JavaScript", "React Native","CSS","Firebase"],
      "features":["Investment pool","Friendly pool","Account and login system", "Easy to use UI"],
      "system": "Pool uses JavaScript (ES6+) as its primary programming language, along with the React and React-Native frameworks, and the Expo development platform. Additionally, the team relies on Node.js for server-side functionality and Git for version control and collaboration.",
      "system-link": {"React-Native":"https://reactnative.dev/"},
      "video": "VJa4_xRdSYE"
    },
    {
      "image": "banner_chihang.png",
      "title": "title_chihang.png",
      "description": "Chihang is a game development project using Unity and C#.",
      "codeLink": "https://github.com/shu0202/Adventure-of-Chi-Hang-final-",
      "language": ["Ren'py", "Python", "ATL"],
      "features":[],
      "system": "",
      "system-link": "",
      "video": ""
    }
  ]
  